RT-Thread/rt-thread/bsp/stm32/libraries/STM32L5xx_HAL/STM32L5xx_HAL_Driver/Inc/stm32l5xx_hal_rcc.h
} RCC_ClkInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Timeout_Value Timeout Values
  * @{
  */
#define RCC_DBP_TIMEOUT_VALUE          2U    /* 2 ms (minimum Tick + 1) */
#define RCC_LSE_TIMEOUT_VALUE          LSE_STARTUP_TIMEOUT
/**
  * @}
  */

/** @defgroup RCC_Oscillator_Type Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE        0x00000000U   /*!< Oscillator configuration unchanged */
#define RCC_OSCILLATORTYPE_HSE         0x00000001U   /*!< HSE to configure */
#define RCC_OSCILLATORTYPE_HSI         0x00000002U   /*!< HSI to configure */
#define RCC_OSCILLATORTYPE_LSE         0x00000004U   /*!< LSE to configure */
#define RCC_OSCILLATORTYPE_LSI         0x00000008U   /*!< LSI to configure */
#define RCC_OSCILLATORTYPE_MSI         0x00000010U   /*!< MSI to configure */
#define RCC_OSCILLATORTYPE_HSI48       0x00000020U   /*!< HSI48 to configure */
/**
  * @}
  */

/** @defgroup RCC_HSE_Config HSE Config
  * @{
  */
#define RCC_HSE_OFF                    0U                                         /*!< HSE clock deactivation */
#define RCC_HSE_ON                     RCC_CR_HSEON                               /*!< HSE clock activation */
#define RCC_HSE_BYPASS                 ((uint32_t)(RCC_CR_HSEBYP | RCC_CR_HSEON)) /*!< External clock source for HSE clock */
/**
  * @}
  */

/** @defgroup RCC_LSE_Config LSE Config
  * @{
  */
#define RCC_LSE_OFF                    0U                                                                 /*!< LSE clock deactivation */
#define RCC_LSE_ON_RTC_ONLY            RCC_BDCR_LSEON                                                     /*!< LSE clock activation for RTC only */
#define RCC_LSE_ON                     ((uint32_t)(RCC_BDCR_LSESYSEN | RCC_BDCR_LSEON))                   /*!< LSE clock activation for RCC and peripherals */
#define RCC_LSE_BYPASS_RTC_ONLY        ((uint32_t)(RCC_BDCR_LSEBYP | RCC_BDCR_LSEON))                     /*!< External clock source for LSE clock */
#define RCC_LSE_BYPASS                 ((uint32_t)(RCC_BDCR_LSEBYP | RCC_BDCR_LSESYSEN | RCC_BDCR_LSEON)) /*!< External clock source for LSE clock */
/**
  * @}
  */

/** @defgroup RCC_HSI_Config HSI Config
  * @{
  */
#define RCC_HSI_OFF                    0U                  /*!< HSI clock deactivation */
#define RCC_HSI_ON                     RCC_CR_HSION        /*!< HSI clock activation */

#define RCC_HSICALIBRATION_DEFAULT     0x00000040U         /* Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config LSI Config
  * @{
  */
#define RCC_LSI_OFF                    0U                  /*!< LSI clock deactivation */
#define RCC_LSI_ON                     RCC_CSR_LSION       /*!< LSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_LSI_Div LSI Div
  * @{
  */
#define RCC_LSI_DIV1                   0U                  /*!< LSI clock is not divided */
#define RCC_LSI_DIV128                 RCC_CSR_LSIPRE      /*!< LSI clock is divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_MSI_Config MSI Config
  * @{
  */
#define RCC_MSI_OFF                    0U                  /*!< MSI clock deactivation */
#define RCC_MSI_ON                     RCC_CR_MSION        /*!< MSI clock activation */

#define RCC_MSICALIBRATION_DEFAULT     0U                  /*!< Default MSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_HSI48_Config HSI48 Config
  * @{
  */
#define RCC_HSI48_OFF                  0U                  /*!< HSI48 clock deactivation */
#define RCC_HSI48_ON                   RCC_CRRCR_HSI48ON   /*!< HSI48 clock activation */
/**
  * @}
  */

/** @defgroup RCC_PLL_Config PLL Config
  * @{
  */
#define RCC_PLL_NONE                   0U                  /*!< PLL configuration unchanged */
#define RCC_PLL_OFF                    1U                  /*!< PLL deactivation */
#define RCC_PLL_ON                     2U                  /*!< PLL activation */
/**
  * @}
  */

/** @defgroup RCC_PLLM_Clock_Divider PLLM Clock Divider
  * @{
  */
#define RCC_PLLM_DIV1                  0x00000001U /*!< PLLM division factor = 1  */
#define RCC_PLLM_DIV2                  0x00000002U /*!< PLLM division factor = 2  */
#define RCC_PLLM_DIV3                  0x00000003U /*!< PLLM division factor = 3  */
#define RCC_PLLM_DIV4                  0x00000004U /*!< PLLM division factor = 4  */
#define RCC_PLLM_DIV5                  0x00000005U /*!< PLLM division factor = 5  */
#define RCC_PLLM_DIV6                  0x00000006U /*!< PLLM division factor = 6  */
#define RCC_PLLM_DIV7                  0x00000007U /*!< PLLM division factor = 7  */
#define RCC_PLLM_DIV8                  0x00000008U /*!< PLLM division factor = 8  */
#define RCC_PLLM_DIV9                  0x00000009U /*!< PLLM division factor = 9  */
#define RCC_PLLM_DIV10                 0x0000000AU /*!< PLLM division factor = 10 */
#define RCC_PLLM_DIV11                 0x0000000BU /*!< PLLM division factor = 11 */
#define RCC_PLLM_DIV12                 0x0000000CU /*!< PLLM division factor = 12 */
#define RCC_PLLM_DIV13                 0x0000000DU /*!< PLLM division factor = 13 */
#define RCC_PLLM_DIV14                 0x0000000EU /*!< PLLM division factor = 14 */
#define RCC_PLLM_DIV15                 0x0000000FU /*!< PLLM division factor = 15 */
#define RCC_PLLM_DIV16                 0x00000010U /*!< PLLM division factor = 16 */
/**
  * @}
  */

/** @defgroup RCC_PLLP_Clock_Divider PLLP Clock Divider
  * @{
  */
#define RCC_PLLP_DIV2                  0x00000002U /*!< PLLP division factor = 2  */
#define RCC_PLLP_DIV3                  0x00000003U /*!< PLLP division factor = 3  */
#define RCC_PLLP_DIV4                  0x00000004U /*!< PLLP division factor = 4  */
#define RCC_PLLP_DIV5                  0x00000005U /*!< PLLP division factor = 5  */
#define RCC_PLLP_DIV6                  0x00000006U /*!< PLLP division factor = 6  */
#define RCC_PLLP_DIV7                  0x00000007U /*!< PLLP division factor = 7  */
#define RCC_PLLP_DIV8                  0x00000008U /*!< PLLP division factor = 8  */
#define RCC_PLLP_DIV9                  0x00000009U /*!< PLLP division factor = 9  */
#define RCC_PLLP_DIV10                 0x0000000AU /*!< PLLP division factor = 10 */
#define RCC_PLLP_DIV11                 0x0000000BU /*!< PLLP division factor = 11 */
#define RCC_PLLP_DIV12                 0x0000000CU /*!< PLLP division factor = 12 */
#define RCC_PLLP_DIV13                 0x0000000DU /*!< PLLP division factor = 13 */
#define RCC_PLLP_DIV14                 0x0000000EU /*!< PLLP division factor = 14 */
#define RCC_PLLP_DIV15                 0x0000000FU /*!< PLLP division factor = 15 */
#define RCC_PLLP_DIV16                 0x00000010U /*!< PLLP division factor = 16 */
#define RCC_PLLP_DIV17                 0x00000011U /*!< PLLP division factor = 17 */
#define RCC_PLLP_DIV18                 0x00000012U /*!< PLLP division factor = 18 */
#define RCC_PLLP_DIV19                 0x00000013U /*!< PLLP division factor = 19 */
#define RCC_PLLP_DIV20                 0x00000014U /*!< PLLP division factor = 20 */
#define RCC_PLLP_DIV21                 0x00000015U /*!< PLLP division factor = 21 */
#define RCC_PLLP_DIV22                 0x00000016U /*!< PLLP division factor = 22 */
#define RCC_PLLP_DIV23                 0x00000017U /*!< PLLP division factor = 23 */
#define RCC_PLLP_DIV24                 0x00000018U /*!< PLLP division factor = 24 */
#define RCC_PLLP_DIV25                 0x00000019U /*!< PLLP division factor = 25 */
#define RCC_PLLP_DIV26                 0x0000001AU /*!< PLLP division factor = 26 */
#define RCC_PLLP_DIV27                 0x0000001BU /*!< PLLP division factor = 27 */
#define RCC_PLLP_DIV28                 0x0000001CU /*!< PLLP division factor = 28 */
#define RCC_PLLP_DIV29                 0x0000001DU /*!< PLLP division factor = 29 */
#define RCC_PLLP_DIV30                 0x0000001EU /*!< PLLP division factor = 30 */
#define RCC_PLLP_DIV31                 0x0000001FU /*!< PLLP division factor = 31 */
/**
  * @}
  */

/** @defgroup RCC_PLLQ_Clock_Divider PLLQ Clock Divider
  * @{
  */
#define RCC_PLLQ_DIV2                  0x00000002U /*!< PLLQ division factor = 2 */
#define RCC_PLLQ_DIV4                  0x00000004U /*!< PLLQ division factor = 4 */
#define RCC_PLLQ_DIV6                  0x00000006U /*!< PLLQ division factor = 6 */
#define RCC_PLLQ_DIV8                  0x00000008U /*!< PLLQ division factor = 8 */
/**
  * @}
  */

/** @defgroup RCC_PLLR_Clock_Divider PLLR Clock Divider
  * @{
  */
#define RCC_PLLR_DIV2                  0x00000002U /*!< PLLR division factor = 2 */
#define RCC_PLLR_DIV4                  0x00000004U /*!< PLLR division factor = 4 */
#define RCC_PLLR_DIV6                  0x00000006U /*!< PLLR division factor = 6 */
#define RCC_PLLR_DIV8                  0x00000008U /*!< PLLR division factor = 8 */
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Source PLL Clock Source
  * @{
  */
#define RCC_PLLSOURCE_NONE             0U                    /*!< No clock selected as PLL entry clock source  */
#define RCC_PLLSOURCE_MSI              RCC_PLLCFGR_PLLSRC_0  /*!< MSI clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_HSI              RCC_PLLCFGR_PLLSRC_1  /*!< HSI clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_HSE              (RCC_PLLCFGR_PLLSRC_1 | RCC_PLLCFGR_PLLSRC_0) /*!< HSE clock selected as PLL entry clock source */
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Output PLL Clock Output
  * @{
  */
#define RCC_PLL_SAI3CLK                RCC_PLLCFGR_PLLPEN      /*!< PLLSAI3CLK selection from main PLL */
#define RCC_PLL_48M1CLK                RCC_PLLCFGR_PLLQEN      /*!< PLL48M1CLK selection from main PLL */
#define RCC_PLL_SYSCLK                 RCC_PLLCFGR_PLLREN      /*!< PLLCLK selection from main PLL */
/**
  * @}
  */

