RT-Thread/rt-thread/bsp/stm32/libraries/STM32L5xx_HAL/STM32L5xx_HAL_Driver/Inc/stm32l5xx_hal_rcc.h
#define IS_RCC_STOP_WAKEUPCLOCK(__SOURCE__) (((__SOURCE__) == RCC_STOP_WAKEUPCLOCK_MSI) || \
                                             ((__SOURCE__) == RCC_STOP_WAKEUPCLOCK_HSI))

#define IS_RCC_ITEMS_ATTRIBUTES(__ITEM__) ((((__ITEM__) & RCC_HSI)   == RCC_HSI)    || \
                                           (((__ITEM__) & RCC_HSE)   == RCC_HSE)    || \
                                           (((__ITEM__) & RCC_MSI)   == RCC_MSI)    || \
                                           (((__ITEM__) & RCC_LSI)   == RCC_LSI)    || \
                                           (((__ITEM__) & RCC_LSE)   == RCC_LSE)    || \
                                           (((__ITEM__) & RCC_HSI48) == RCC_HSI48)         || \
                                           (((__ITEM__) & RCC_SYSCLK)   == RCC_SYSCLK)     || \
                                           (((__ITEM__) & RCC_PRESCALER) == RCC_PRESCALER) || \
                                           (((__ITEM__) & RCC_PLL)       == RCC_PLL)       || \
                                           (((__ITEM__) & RCC_PLLSAI1)   == RCC_PLLSAI1)   || \
                                           (((__ITEM__) & RCC_PLLSAI2)   == RCC_PLLSAI2)   || \
                                           (((__ITEM__) & RCC_CLK48M)    == RCC_CLK48M)    || \
                                           (((__ITEM__) & RCC_RMVF)  == RCC_RMVF)          || \
                                           (((__ITEM__) & ~(RCC_ALL)) == 0U))

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)

#define IS_RCC_ATTRIBUTES(__ATTRIBUTES__) (((((__ATTRIBUTES__) & RCC_SEC) == RCC_SEC) || \
                                            (((__ATTRIBUTES__) & RCC_NSEC) == RCC_NSEC) || \
                                            (((__ATTRIBUTES__) & RCC_PRIV) == RCC_PRIV) || \
                                            (((__ATTRIBUTES__) & RCC_NPRIV) == RCC_NPRIV)) && \
                                           (((__ATTRIBUTES__) & ~(RCC_SEC|RCC_NSEC|RCC_PRIV|RCC_NPRIV)) == 0U))

#else

#define IS_RCC_ATTRIBUTES(__ATTRIBUTES__) (((((__ATTRIBUTES__) & RCC_PRIV) == RCC_PRIV) || \
                                            (((__ATTRIBUTES__) & RCC_NPRIV) == RCC_NPRIV)) && \
                                           (((__ATTRIBUTES__) & ~(RCC_PRIV|RCC_NPRIV)) == 0U))

#endif /* __ARM_FEATURE_CMSE */

/**
  * @}
  */

/* Include RCC HAL Extended module */
#include "stm32l5xx_hal_rcc_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_Exported_Functions
  * @{
  */


/** @addtogroup RCC_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ******************************/
HAL_StatusTypeDef HAL_RCC_DeInit(void);
HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef *RCC_ClkInitStruct, uint32_t FLatency);

/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group2
  * @{
  */

/* Peripheral Control functions  ************************************************/
void              HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv);
void              HAL_RCC_EnableCSS(void);
uint32_t          HAL_RCC_GetSysClockFreq(void);
uint32_t          HAL_RCC_GetHCLKFreq(void);
uint32_t          HAL_RCC_GetPCLK1Freq(void);
uint32_t          HAL_RCC_GetPCLK2Freq(void);
void              HAL_RCC_GetOscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
void              HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef *RCC_ClkInitStruct, uint32_t *pFLatency);
/* CSS NMI IRQ handler */
void              HAL_RCC_NMI_IRQHandler(void);
/* User Callbacks in non blocking mode (IT mode) */
void              HAL_RCC_CSSCallback(void);

/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group3
  * @{
  */

/* Attributes management functions ******************************************/
void              HAL_RCC_ConfigAttributes(uint32_t Item, uint32_t Attributes);
HAL_StatusTypeDef HAL_RCC_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32L5xx_HAL_RCC_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
